Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationHangerHostNotFound Property
 The hanger will disconnect because we can't find the suitable host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationHangerHostNotFound { get; }
Public Shared ReadOnly Property FabricationHangerHostNotFound As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationHangerHostNotFound {
	FailureDefinitionId^ get ();
}
static member FabricationHangerHostNotFound : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace